Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Working locally and having someone push to your remote server makes each history move forward differently.
cs: Pokud pracujete lokálně a někdo jiný odešle svou práci na vzdálený server, obě historie se rozejdou.

source: Works perfectly!
cs: Funguje to perfektně!

source: Wouldn’t it be nice if Git could store one of them in full but then the second object only as the delta between it and the first?
cs: Nebylo by krásné, kdyby Git mohl uložit jeden z nich v plné velikosti, ale druhý už jen jako rozdíl mezi oběma těmito objekty?

source: Wrap it to about 72 characters or so.
cs: Snažte se nepřesáhnout zhruba 72 znaků.

source: Write out that tree (recording the state of the staging area or index to a tree object) and see what it looks like:
cs: Uložte tento strom (zaznamenáním stavu oblasti připravených změn neboli indexu do objektu stromu) a prohlédněte si výsledek:

source: You _stage_ these modified files and then commit all your staged changes, and the cycle repeats.
cs: Poté všechny tyto změněné soubory _připravíte k zapsání_ (stage) a následně všechny připravené změny zapíšete (commit). A celý cyklus se opakuje.

source: You accomplish that by using refspecs to push.
cs: Tady vám při odesílání větví pomůže vzorec refspec.

source: You add external projects as submodules with the `git submodule add` command:
cs: Externí projekty přidáte do svého projektu jako submoduly příkazem `git submodule add`:

source: You add the Rack project as a remote reference in your own project and then check it out into its own branch:
cs: Projekt Rack přidáte ve vlastním projektu jako vzdálenou referenci a provedete jeho checkout do vlastní větve:

source: You administer your Gitolite setup by making changes to this repository and pushing.
cs: Své nastavení Gitolite spravujete pomocí provádění změn v tomto repozitáři jejich odesíláním (push).

source: You also don’t have any information about who saved the snapshots, when they were saved, or why they were saved.
cs: Nemáte také žádné informace o tom, kdo snímky uložil, kdy byly uloženy a proč se tak stalo.

source: You also have access to the user doing the pushing if the push is being run over SSH.
cs: Pokud jsou revize odesílány prostřednictvím SSH, budete mít přístup také k uživateli, který data odesílá.

source: You also need to make sure these tools are executable:
cs: Dále se potřebujete také ujistit, že lze tyto nástroje spustit:

source: You and the other developers all have push access to the repository.
cs: Vy a vaši ostatní vývojáři máte všichni oprávnění odesílat změny do repozitáře.

source: You aren’t encouraged to directly edit the reference files.
cs: Tím vás nenabádám, abyste přímo editovali soubory referencí.

source: You begin by reading this data into a structure that you can use.
cs: Začnete načtením těchto dat do struktury, kterou můžete použít.

source: You branched a topic branch (`server`) to add some server-side functionality to your project, and made a commit.
cs: Vytvořili jste novou tematickou větev (`server`), pomocí níž chcete do svého projektu přidat funkci na straně serveru, a zapsali jste revizi.

source: You can accomplish that with a few `git add` commands that specify the files you want to track, followed by a commit:
cs: Můžete tak učinit pomocí několika příkazů `git add`, jimiž určíte soubory, které chcete sledovat, a provedete revizi:

source: You can accomplish the same task with `--tree-filter` if you want.
cs: Pokud chcete, můžete provést stejný úkon i pomocí parametru `--tree-filter`.

source: You can add it after the fact.
cs: Značku můžete přidat dodatečně.

source: You can add it as a new remote reference to the project you’re currently working on by running the `git remote add` command as we covered in Chapter 2.
cs: Můžete ho přidat jako novou vzdálenou referenci k projektu, na němž právě pracujete – spusťte příkaz `git remote add` (viz kapitola 2).

source: You can add the following line to your Git attributes file:
cs: Do souboru s atributy Git můžete přidat následující řádek:

source: You can also change them at any time by running through the commands again.
cs: Opětovným použitím příkazů můžete nastavení kdykoliv změnit.

source: You can also check what Git thinks a specific key’s value is by typing `git config {key}`:
cs: Můžete také zkontrolovat, jakou hodnotu Git uchovává pro konkrétní klíč zadáním `git config {klíč}`:

source: You can also combine these syntaxes — you can get the second parent of the previous reference (assuming it was a merge commit) by using `HEAD~3^2`, and so on.
cs: Tyto syntaxe můžete také kombinovat. Druhého rodiče předchozí reference (jestliže se jednalo o revizi sloučením) lze získat výrazem `HEAD~3^2` atd.

source: You can also continue this concept, having an integrate branch where all the work is merged together.
cs: Tento koncept můžete dále rozšířit o integrační větev, v níž budete veškerou práci slučovat.

source: You can also create a zip archive in much the same way, but by passing the `--format=zip` option to `git archive`:
cs: Stejným způsobem můžete vytvořit také archiv zip. K příkazu `git archive` stačí přidat parametr `--format=zip`:

source: You can also do `git push origin serverfix:serverfix`, which does the same thing — it says, “Take my serverfix and make it the remote’s serverfix.” You can use this format to push a local branch into a remote branch that is named differently.
cs: Můžete rovněž zadat příkaz `git push origin serverfix:serverfix`, který provede totéž. Systému Git říká: „Vezmi mou větev `serverfix` a udělej z ní `serverfix` na vzdáleném serveru.“ Tento formát můžete použít k odeslání lokální větve do vzdálené větve, která se jmenuje jinak.

source: You can also do the opposite — make changes in the `rack` subdirectory of your master branch and then merge them into your `rack_branch` branch later to submit them to the maintainers or push them upstream.
cs: Můžete ale postupovat také opačně – provést změny v podadresáři `rack` vaší hlavní větve, poté je začlenit do větve `rack_branch` a poslat je správcům nebo je odeslat do repozitáře.

source: You can also do this with content in files.
cs: Totéž můžete udělat také s obsahem v souborech.

source: You can also edit these patch files to add more information for the e-mail list that you don’t want to show up in the commit message.
cs: Tyto soubory záplaty můžete také upravit a přidat k nim další informace určené pro seznam příjemců e-mailu, u nichž nechcete, aby byly obsaženy ve zprávě k revizi.

source: You can also filter the list to commits that match some search criteria.
cs: Z výpisu rovněž můžete filtrovat pouze revize, které odpovídají určitým kritériím.

source: You can also get the same sort of information that `svn info` gives you by running `git svn info`:
cs: Stejné informace, jaké poskytuje příkaz `svn info`, získáte příkazem `git svn info`:

source: You can also have modified and uncommitted files in your working directory when you apply a stash — Git gives you merge conflicts if anything no longer applies cleanly.
cs: Když aplikujete odklad, můžete mít v pracovním adresáři také změněné a nezapsané soubory. Nebude-li něco aplikováno čistě, Git vám oznámí konflikty při slučování.

source: You can also have your rebase replay on something other than the rebase branch.
cs: Opětovné provedení změn pomocí příkazu rebase můžete využít i jiným účelům než jen k přeskládání větve.

source: You can also initiate the process via the Git daemon, which listens on a server on port 9418 by default.
cs: Proces můžete iniciovat také prostřednictvím démona Git, který na serveru standardně naslouchá portu 9418.

source: You can also leave off one side of the syntax to have Git assume HEAD.
cs: Jednu stranu intervalu můžete zcela vynechat, Git na její místo automaticky dosadí HEAD.

source: You can also manually edit this file, but again a safer command exists to do so: `symbolic-ref`.
cs: Soubor můžete editovat také ručně, ale opět existuje i bezpečnější příkaz: `symbolic-ref`.

source: You can also manually repack at any time by running `git gc` by hand.
cs: Totéž lze kdykoli provést i ručně spuštěním příkazu `git gc`.

source: You can also not specify a user, and Git assumes the user you’re currently logged in as.
cs: Stejně tak nemusíte zadávat ani uživatele, Git automaticky použije uživatele, jehož účtem jste právě přihlášeni.

source: You can also pipe it through the `tail` command because you’re only interested in the last few largest files:
cs: Na výpis můžete rovněž použít příkaz `tail`, neboť vás beztak zajímá pouze několik posledních (největších) souborů:

source: You can also run `git stash pop` to apply the stash and then immediately drop it from your stack.
cs: Můžete také spustit příkaz `git stash pop`, jímž odklad aplikujete a současně ho odstraníte ze zásobníku.

source: You can also run something like `make` or `make tests` or whatever you have that runs automated tests for you.
cs: Podobně můžete spustit také příkaz `make` nebo `make tests` či cokoli jiného, čím spouštíte automatické testování.

source: You can also search for tags with a particular pattern.
cs: Značky lze vyhledávat také pomocí konkrétní masky.

source: You can also see from the header on each of your project’s pages that you have two Git URLs (see Figure 4-8).
cs: V záhlaví na stránce všech vašich projektů si můžete všimnout, že máte dvě adresy URL (viz obrázek 4-8).

source: You can also send the patches through an SMTP server.
cs: Záplaty můžete odesílat i přes SMTP server.

source: You can also serve your repositories read-only over HTTPS, which means you can encrypt the content transfer; or you can go so far as to make the clients use specific signed SSL certificates.
cs: Své repozitáře můžete zpřístupnit ke čtení prostřednictvím protokolu HTTPS, což znamená, že se přenášený obsah šifruje. Nebo můžete zajít ještě dál a vyžadovat, aby klienti používali konkrétní podepsané SSL certifikáty.

source: You can also set the value of HEAD:
cs: Hodnotu pro soubor HEAD můžete také nastavit:

source: You can also set these values by manually editing the file and inserting the correct syntax, but it’s generally easier to run the `git config` command.
cs: Tyto hodnoty můžete nastavit také ruční editací souboru a vložením příslušné syntaxe, většinou je však snazší spustit příkaz `git config`.

source: You can also set up a custom tool; see Chapter 7 for more information about doing that.
cs: Nastavit můžete ale i jiné uživatelské nástroje — více informací o této možnosti naleznete v kapitole 7.

source: You can also set up a graphical merge conflict-resolution tool instead of having to resolve conflicts manually.
cs: Stejně tak můžete nastavit vlastní grafický nástroj k řešení konfliktů při slučování, nechcete-li řešit konflikty ručně.

source: You can also sign your tags with GPG, assuming you have a private key.
cs: Máte-li soukromý klíč, lze značky rovněž podepsat v programu GPG.

source: You can also specify `-v`, which shows you the URL that Git has stored for the shortname to be expanded to:
cs: Můžete rovněž zadat parametr `-v`, jenž zobrazí adresu URL, kterou má Git uloženou pro zkrácený název, který si přejete rozepsat.

source: You can also specify a number after the `^` — for example, `d921970^2` means "the second parent of d921970." This syntax is only useful for merge commits, which have more than one parent.
cs: Za znakem `^` můžete zadat také číslo, např. `d921970^2` označuje „druhého rodiče revize d921970“. Tato syntaxe má význam pouze u revizí vzniklých sloučením, které mají více než jednoho rodiče.

source: You can also specify another group as one of the members (using `@` as prefix), to inherit all of its members automatically:
cs: Jako jednoho ze členů skupiny můžete zadat také celou jinou skupinu (použijete pro ni předponu `@`). Všichni její členové se tím automaticky zdědí:

source: You can also specify multiple refspecs for fetching in your configuration file.
cs: V konfiguračním souboru můžete také použít více vzorců refspec pro vyzvedávání dat.

source: You can also specify multiple refspecs.
cs: Použít lze také kombinaci několika vzorců refspec.

source: You can also tag commits after you’ve moved past them.
cs: Revizi lze označit značkou i poté, co jste ji už opustili.

source: You can also tell `git svn` not to include the metadata that Subversion normally imports, by passing `--no-metadata` to the `clone` or `init` command.
cs: Nástroji `git svn` můžete také zadat, aby ignoroval metadata, která systém Subversion normálně importuje: zadejte parametr `--no-metadata` k příkazu `clone` nebo `init`.

source: You can also use Git attributes to tell Git to use different merge strategies for specific files in your project.
cs: Atributy Git lze použít také k nastavení různých strategií slučování pro různé soubory v projektu.

source: You can also use `-2`, which limits the output to only the last two entries:
cs: Můžete také použít parametr `-2`, který omezí výpis pouze na dva poslední záznamy:

source: You can also use `git apply` to see if a patch applies cleanly before you try actually applying it — you can run `git apply --check` with the patch:
cs: Příkaz `git apply` můžete použít také ke kontrole, zda bude záplata aplikována čistě. V takovém případě použijte na patch příkaz `git apply --check`:

source: You can also use a built-in macro `binary` that means `-crlf -diff`:
cs: Můžete také použít zabudované makro `binary` s významem `-crlf -diff`:

source: You can also use a series of summarizing options with `git log`.
cs: Ve spojení s příkazem `git log` můžete použít také celou řadu shrnujících parametrů.

source: You can also use interactive rebases to reorder or remove commits entirely.
cs: Interaktivní přeskládání můžete použít rovněž ke změně pořadí revizí nebo k jejich odstranění.

source: You can also use the refspec to delete references from the remote server by running something like this:
cs: Vzorce refspec můžete využít také k mazání referencí ze vzdáleného serveru. Spustit lze například příkaz následujícího znění:

source: You can also use this string as the target of a checkout or show command, although it relies on the abbreviated SHA-1 value at the end, so it may not be valid forever.
cs: Tento řetězec můžete také použít jako cíl příkazu checkout nebo show, ačkoli ty pracují se zkrácenou hodnotou SHA-1, a tak nebudou platné navždy.

source: You can also use this syntax to see where a branch was some specific amount of time ago.
cs: Tuto syntaxi můžete použít také k zobrazení pozice, na níž se větev nacházela před určitou dobou.

source: You can also verify that this is a tree object:
cs: Můžete si také ověřit, že jde skutečně o objekt stromu:

source: You can ask Git to show you a log of just those commits with `master..experiment` — that means "all commits reachable by experiment that aren’t reachable by master." For the sake of brevity and clarity in these examples, I’ll use the letters of the commit objects from the diagram in place of the actual log output in the order that they would display:
cs: Pomocí výrazu `master..experiment` můžete systému Git zadat příkaz, aby vám zobrazil log právě s těmito revizemi, doslova „všemi revizemi dostupnými z větve experiment a nedostupnými z hlavní větve“. V zájmu stručnosti a názornosti použiji v těchto příkladech místo skutečného výstupu logu písmena objektů revizí z diagramu v pořadí, jak by se zobrazily:

source: You can bisect the code to find out.
cs: K odhalení problému můžete použít příkaz bisect (tedy „rozpůlit“).

source: You can calculate the SHA-1 value of a string in Ruby by including the SHA1 digest library with the `require` command and then calling `Digest::SHA1.hexdigest()` with the string:
cs: V Ruby můžete hodnotu SHA-1 daného řetězce spočítat tak, že příkazem `require` připojíte knihovnu pro počítání SHA1 a zavoláte `Digest::SHA1.hexdigest()` s daným řetězcem:

source: You can control permissions at the "ref" level.
cs: Můžete nastavovat přístupová práva na úrovni referencí.

source: You can control which projects GitWeb lets users browse by adding or removing a `gitweb` setting in the Gitosis configuration file.
cs: Vložením nebo odstraněním nastavení `gitweb` z konfiguračního souboru Gitosis můžete určit, které projekty dovolí GitWeb uživatelům procházet.

source: You can create a new directory and then run `git init` in it for a starting point, and then run your script:
cs: Můžete vytvořit nový adresář a spustit v něm příkaz `git init`, jímž si vytvoříte nový výchozí bod. Poté spusťte svůj skript:

source: You can create a new tag as I discussed in Chapter 2.
cs: Novou značku vytvoříte podle návodu v kapitole 2.

source: You can create an account, add a new project, and push to it in a matter of minutes.
cs: Vytvoření účtu, přidání nového projektu a odeslání prvních revizí je záležitostí několika minut.

source: You can create as many of these groups as you want, each containing different users and projects.
cs: Takových skupin můžete vytvořit libovolně mnoho. Každá může obsahovat různé uživatele a projekty.

source: You can create your own tree.
cs: Můžete si vytvořit i vlastní strom.

source: You can daemonize this process a number of ways, depending on the operating system you’re running.
cs: Podle toho, jaký operační systém používáte, můžete přejít do režimu démon mnoha způsoby.

source: You can decide what files go into which commits right before you commit with the staging area, you can decide that you didn’t mean to be working on something yet with the stash command, and you can rewrite commits that already happened so they look like they happened in a different way.
cs: Jaké soubory budou součástí jaké revize? To můžete rozhodnout až těsně před tím, než soubory zapíšete z oblasti připravených změn. Můžete se rozmyslet, že jste na něčem ještě nechtěli pracovat, a použít možnost odložení. A stejně tak můžete přepsat už jednou zapsané revize. Budou vypadat, jako by byly zapsány v jiné podobě.

source: You can delete a remote branch using the rather obtuse syntax `git push [remotename] :[branch]`.
cs: Vzdálenou větev nyní můžete smazat pomocí poněkud neohrabané syntaxe `git push [vzdálený server] :[větev]`.

source: You can delete it and then manually close the ticket in your ticket-tracking system:
cs: Můžete ji smazat a poté ručně zavřít tiket v systému sledování tiketů:

source: You can delete it with the `-d` option to `git branch`:
cs: Větev smažete přidáním parametru `-d` k příkazu `git branch`:

source: You can disable settings by either leaving them out of the setting string or prepending a `-` in front of the value.
cs: Funkci vypnete buď tím, že ji z řetězce nastavení zcela vynecháte, nebo tím, že před hodnotu vložíte znak `-`.

source: You can distribute these hooks within the project or in a separate project, but there is no way to set them up automatically.
cs: Zásuvné moduly můžete distribuovat v rámci projektu nebo v samostatném projektu, nelze je však nastavit automaticky.

source: You can do a lot more with the `fast-import` tool — handle different modes, binary data, multiple branches and merging, tags, progress indicators, and more.
cs: Nástroj `fast-import` vám nabízí ještě spoustu dalších možností – nastavení různých režimů, práci s binárními daty, manipulaci s několika větvemi a jejich slučování, značky, ukazatele postupu atd.

source: You can do so with the `sed` command on Unix systems:
cs: V systémech Unix to lze provést příkazem `sed`:

source: You can do that in Git with `git read-tree`.
cs: V systému Git k tomu slouží příkaz `git read-tree`.

source: You can do that in the `rebase -i` script by changing the instruction on the commit you want to split to "edit":
cs: Můžete to provést pomocí skriptu `rebase -i`. U revize, kterou si přejete rozdělit, změňte instrukci na edit:

source: You can do things like check for code style (run lint or something equivalent), check for trailing whitespace (the default hook does exactly that), or check for appropriate documentation on new methods.
cs: Můžete kontrolovat záležitosti jako styl kódu (spustit lint apod.), koncové mezery (výchozí zásuvný modul dělá právě toto) nebo správnou dokumentaci k novým metodám.

source: You can do this by listing them with the `bisect start` command if you want, listing the known bad commit first and the known good commit second:
cs: Chcete-li, můžete to provést příkazem `bisect start` –- jako první uvedete známou revizi s chybou, jako druhá bude následovat poslední známá dobrá revize:

source: You can do this with `-U1` as we did in the example above.
cs: Můžeme toho dosáhnout zadáním parametru `-U1`, jako ve výše uvedeném příkladu.

source: You can download P4Merge here:
cs: P4Merge můžete stáhnout na této adrese:

source: You can easily check to see if you have a key already by going to that directory and listing the contents:
cs: Nejsnazší způsob kontroly, zda už klíč vlastníte, je přejít do tohoto adresáře a zjistit jeho obsah:

source: You can easily see that the file size and image dimensions have both changed.
cs: Jasně vidíte, že se změnila jak velikost souboru, tak rozměry obrázku.

source: You can easily see what commits modified this file:
cs: Pomocí snadného příkazu lze zjistit, jaké revize tento soubor změnil:

source: You can edit the message the same as always, but it overwrites your previous commit.
cs: Zprávu můžete editovat stejným způsobem jako vždy. Zpráva přepíše předchozí revizi.

source: You can either run `git submodule update` to reclone, or you can move your `/tmp/rack` directory back into the empty directory.
cs: Buď můžete spustit příkaz `git submodule update` a provést nové klonování, nebo můžete přesunout adresář `/tmp/rack` zpět do prázdného adresáře.

source: You can enable push access; but given the lack of authentication, if you turn on push access, anyone on the internet who finds your project’s URL could push to your project.
cs: Možnost odesílání lze zapnout, ale vzhledem k tomu, že protokol neumožňuje autentizaci, aktivované odesílání znamená, že kdokoli na internetu, kdo najde URL vašeho projektu, do něj bude moci odesílat data.

source: You can enforce policy on the server side to reject pushes of commits that don’t conform to some policy, but it’s entirely up to the developer to use these scripts on the client side.
cs: Standardy můžete kontrolovat na straně serveru a odmítnout odesílané revize, které neodpovídají požadavkům. Záleží však jen na samotném vývojáři, jestli bude tyto skripty využívat i na straně klienta.

source: You can exclude commits in the master branch by adding the `--not` option before the branch name.
cs: Revize v hlavní větvi lze vyloučit vložením parametru `--not` před název větve.

source: You can get a Git project using two main approaches.
cs: Projekt v systému Git lze získat dvěma základními způsoby.

source: You can get a list of the SHA-1 values of all the commits that are being pushed by taking the `$newrev` and `$oldrev` values and passing them to a Git plumbing command called `git rev-list`.
cs: Vezmete-li hodnoty `$newrev` a `$oldrev` a zadáte je k nízkoúrovňovému příkazu `git rev-list`, získáte seznam hodnot SHA-1 všech odesílaných revizí.

source: You can get it a number of ways; the two major ones are to install it from source or to install an existing package for your platform.
cs: Většinou se využívá buď instalace ze zdrojových souborů, nebo instalace z existujícího balíčku, určeného pro vaši platformu.

source: You can get very specific about what you want colored and how; but to turn on all the default terminal coloring, set `color.ui` to true:
cs: Lze přitom velmi podrobně určit, co chcete barevně označit a jak. Chcete-li zapnout výchozí barvy terminálu, nastavte parametr `color.ui` na hodnotu true:
